{
  "beginner": [
    {
      "name": "1. Дыхание (2020)",
      "description": "",
      "text": "Запись четырехдневного онлайн курса. Упражнения суставной гимнастики и цигун для восстановления целостности тела, духа и разума. Раскрытие дыхания и свободы внутренних движений через расслабление тела и мягкое сосредоточение на действиях. Собирает вместе тело и разум, наполняет организм силой. Подходит всем, так как дыхание является основой для любой деятельности.",
      "url": "https://taihe.zenclass.ru/public/course/702482da-2830-48e8-9be2-91c0438fa201"
    },
    {
      "name": "2. Дыхательные гимнастики (видеокурс)",
      "description": "",
      "text": "Полная видео шпаргалка по нашей цигунско-остеопатической книге. Подробные и глубокие пояснения всех упражнений, демонстрация выполнения, детальный разбор что, как и зачем делаем. Девять готовых дыхательных комплексов на все случаи (лежа, сидя, стоя, в разных фазах болезни, профилактические). Доступно в любом возрасте и состоянии здоровья.",
      "url": "https://taihe.zenclass.ru/public/course/9e298969-e2e1-433a-89ce-37324386731d"
    },
    {
      "name": "3. Самомассаж Даоинь Аньмо",
      "description": "",
      "text": "Запись семидневного онлайн курса по даосскому самомассажу. Снятие напряжения с крупных и мелких мышц, восстановление баланса взаимных натяжений фасциальной сети, укрепление иммунитета, нормализация самочувствия. Настройка тонких ощущений, знакомство с собственным телом, восстановление нормальных функций организма через акупунктурные точки и фасции. Бережная и мягкая техника, доступна в любом возрасте и состоянии здоровья.",
      "url": "https://taihe.zenclass.ru/public/course/27ee2945-a413-4b22-a29e-6cbd9371fec8"
    },
    {
      "name": "4. Нэйгун фаза 1.\nПервые шаги к мастерству",
      "description": "",
      "text": "Основа для всех дальнейших техник цигун и тайцзи, самая важная теория и практика для поддержания здоровья и накопления сил. Базовые принципы позиций и движений тела, настройка ума и дыхания. Упражнения для подзарядки энергией, восстановления внутреннего спокойствия и эмоционального баланса. Упражнения простые и неспешные, на курсе есть понемногу из разных тем, чтобы можно было понять, куда развиваться дальше. Обратная связь и комментарии учителя. Идеально для начинающих.",
      "url": "https://taihe.zenclass.ru/public/course/5573f0e7-dcd0-483c-b42a-a2710ce4d3a5"
    }
  ],
  "master": [
    {
      "name": "1. НЭЙГУН ФАЗА 2",
      "description": "Земля, ноги и Нижний Даньтянь",
      "text": "Связь с Землёй (укоренение, устойчивость и уверенность). Ноги (надёжное основание для позвоночника). Шаги (подвижность и свобода перемещений). Мочеполовая система (основа чистоты и жизненности). Нижний Даньтянь (внутренний ресурс и запас сил). Записи 9 прямых эфиров, дополнительные уроки, тексты по теории, домашние задания, чат для общения и обратной связи.",
      "url": "https://taihe.zenclass.ru/public/course/1d1d3dc1-055a-406b-8b1f-4589fcfeb727"
    },
    {
      "name": "2. НЭЙГУН ФАЗА 3",
      "description": "Живот, центр и Средний Даньтянь",
      "text": "Живот (ощущение центра жизни). Пищеварительная система (энергия, питание и внутреннее тепло). Связь с окружающей средой (подзарядка и бережный взаимообмен). Средний Даньтянь (методы тренировки, сохранение и трансформация Ци). Записи 12 прямых эфиров, дополнительные уроки, тексты по теории, домашние задания, чат для общения и обратной связи.",
      "url": "https://taihe.zenclass.ru/public/course/33285033-3918-448e-baf8-24b95f57bcf9"
    },
    {
      "name": "3. НЭЙГУН ФАЗА 4",
      "description": "Разум и Сердце, верхний Даньтянь и связь с Небом",
      "text": "Курс повторяется раз в полгода, записи доступны только для участников «живых» потоков.\n- Голова, руки, грудная клетка и верхний Даньтянь, расслаблениеи питание.\n- Дыхательная и сердечно-сосудистая система, движение Ци.\n- Покой, сосредоточение и отдых для ума.\n- Размышления и наблюдение, тонкое чувствование своих     состояний, принятие и отпускание.- Гармония тела, духа и разума, открытие Сердца.\n- Объединение практики и повседневной жизни.",
      "url": ""
    },
    {
      "name": "4. Чаньсыгун",
      "description": "«Наматывание нити» и суставная гимнастика",
      "text": "Знакомство с собой, развитие внимательности к ощущениям. Баланс натяжений фасциальной ткани. Свобода и согласованность движений всех суставов. Культура здорового движения и правильные двигательные привычки. Связь настроения и осанки. Дух здоровья и ресурс самоисцеления. Чаньсыгун - это хороший способ поддержать себя в любом возрасте. Прекрасно разминается все тело, разгоняется кровь, бережно питаются клетки и ткани. Движения простые и понятные. Заниматься могут все.",
      "url": "https://taihe.zenclass.ru/public/course/222f5d02-b146-4953-8ed5-0582fa157b91"
    },
    {
      "name": "5. ТАЙЦЗИБАН 48 ФОРМ",
      "description": "",
      "text": "Подборка различных упражнений (форм) с \"волшебной палочкой тайцзи\". В программе курса: суставная гимнастика (чаньсы), координация, самомассаж, расслабление (фансун), внутреннее мастерство (нэйгун), шаги, техника и формы тайцзицюань. Заниматься с тайцзибан интересно, прогресс идет быстро. Хорошими темпами осваиваются методы для укрепление тела и расслабления ума, ставится техническая база для занятий, открываются новые аспекты привычных движений.",
      "url": "https://taihe.zenclass.ru/public/course/ad3be6ca-5923-4c1c-a792-66b3b1d9913d"
    },
    {
      "name": "6. Хуньюаньгун",
      "description": "12 форм Хуньюань Нэйгун",
      "text": "Настоящая «жемчужина» нэйгун! Комплекс составлен учителем Фэн Чжицяном. Отличный способ укрепить здоровье и обрести мощную базу для занятий тайцзицюань. Очищение организма на уровне тела, энергии и ума. Собирание и преумножение Ци. Свобода внутреннего движения. Упорядочивание циркуляции по трактам (Цзин-Ло) и сосудам (Ба-май). Долговременное использование накопленной Ци. Основа упражнений - сочетание мягких движений, глубокого дыхания и чуткого расслабленного внимания. Подходит всем.",
      "url": "https://taihe.zenclass.ru/public/course/ab25a6d1-6713-47b9-87d1-f65de988eb19"
    },
    {
      "name": "7. Утро Тайцзи и «Восемь усилий» Ба фа",
      "description": "",
      "text": "Прекрасный вариант для начала знакомства с тайцзицюань и цигун. На курсе доступны 18 уроков по 1 часу. На каждом: общая разминка и подзарядка, подготовительные упражнения (30 минут); изучение базовой техники тайцзи «Восемь усилий» Ба Фа(30 минут). Каждый третий урок - с тайцзибан (палочкой тайцзи). Уроки не повторяются, материал разнообразен. При желании можно проходить одно занятие много раз, осваивая курс в удобном режиме.",
      "url": "https://taihe.zenclass.ru/public/course/d85c42f2-a823-49a2-ac90-66c0c37b4821"
    },
    {
      "name": "8. «13 ФОРМ ХУНЬЮАНЬ ТАЙЦЗИ»",
      "description": "",
      "text": "Учебное видео для самостоятельного изучения базовой формы Хуньюань Тайцзицюань (3 урока теория+практика):\n- Ба Фа (восемь базовых усилий руками) Пэн, Люй, Цзи, Ань, Цай, Ле, Чжоу, Као.\n- Усин (пять движений) перемещения и шаги.\n- Два варианта исполнения 8 усилий (прямой дорожкой и в шагах на разные направления) соединяются в последовательность из13 форм Хуньюань Тайцзицюань.\n\nДополнительно: Общая теория Хуньюань тайцзи, связь формыи нэйгун, построение личной практики. Обратная связь и комментарии учителя.",
      "url": "https://taihe.zenclass.ru/public/course/3a002a8f-de36-4a45-9696-f2c3a4c2aae3"
    }
  ]
}
