[
  {
    "name": "Максим",
    "course": "курс «Дыхание»",
    "text": "С сердечной благодарностью и хорошим настроением я присоединяюсь к отзывам о прошедшем курсе, да и вообще ко всему что делается Натальей! Сейчас для меня уже не стоит вопрос об участии в ее курсах, даже если я их уже проходил, так как это всегда как минимум повторение, но и возможность увидеть, почувствовать новые аспекты в практике. Это курсы с акцентом на здоровье, это необычная атмосфера и энергетика, это возможность прикоснуться к традиции, это возможность ближе познакомиться с собой, укрепить свои тело, дух и разум - стать более целостным! Большое тебе спасибо, Наташ!"
  },
  {
    "name": "Ружена",
    "course": "Курс «Нэйгун Фаза 2»",
    "text": "Наташа! Этот Курс замечательный! Как и все, что Вы даете, очень глубоко и понятно, и спокойно, и умиротворенно. Спасибо Вам огромное! И очень здорово, что всегда есть продолжение, это мотивирует. Да, вы абсолютно правы - практики вплетаются в жизнь, даже автоматически бывает)) Спасибо большущее!"
  },
  {
    "name": "Виктория",
    "course": "Курс «Нэйгун Фаза 2»",
    "text": "Спасибо Вам огромное за этот курс, он очень глубокий. Это то, что я искала, даже четко не осознавая, что именно мне нужно, все интуитивно. Для меня этот курс про тонкость восприятия, про чувствование и понимания себя и мира вокруг, а то, что еще все и в организме выравнивается, это приятный бонус :) Ну опять таки, все взаимосвязано. Стопы ликуют! Никогда им еще столько внимания не уделялось. Наташа, благодарю Вас от всего сердца и сквозь пространство обнимаю Вас!"
  },
  {
    "name": "Ольга",
    "course": "Курс «Нэйгун Фаза 3»",
    "text": "Спасибо за курс! Уже слышала многое, начинала понимать на предыдущих ваших курсах. Но теперь все это с другого ракурса. Все классно и насущно как воздух. С пониманием все встаёт на свои места. Спасибо за возможность развития!"
  },
  {
    "name": "Александр",
    "course": "Курс «Чаньсыгун»",
    "text": "Большое вам спасибо. Вашим ученикам очень повезло с вами, вы очень интересно и доступно все объясняете. Большинство намоток для меня были знакомыми, многие делал, когда активно занимался Чэн Ши Тайцзи, даже вспомнил, как занимался этими намотками с деревянными шарами. Но были намотки, которые сломали мне голову:) Пришлось повозиться, некоторые не совсем понял) Во многих намотках получилось связать с даньтянь 18 сфер, прям торнадо по всему телу; накручивал минут 20 одну намотку и понял, что нет сфер, все один даньтянь, все один большой кокон."
  },
  {
    "name": "Настя",
    "course": "Курс «Нэйгун Фаза 3»",
    "text": "Наташа, большое спасибо за курс! Было приятно позаниматься опять в твоем поле! Не так, как вживую, но тоже чувствовалось. Из упражнений любимые - намотки и собирание энергии в даньтянь. И стоять было хорошо )) Также оценила, как важна пауза перед практикой - не зря у тебя всегда был сначала чай, а потом занятие. Прибежать и сразу заниматься - эффект вполовину меньший. Спасибо!"
  },
  {
    "name": "Максим",
    "course": "Курс «Нэйгун Фаза 4»",
    "text": "Очень необычный курс! Я рад в нем поучаствовать, пусть и не все получилось охватить, это хорошая перспектива. Если до него виделись два полюса: здоровье и боевые искусства, то сейчас практика ощущается более многогранной. Человек в практике может развивать честность, добродетель, культивировать в себе и другие нравственные качества, больше думать об окружающем мире и людях. Благодарю Наталью и участников за совместную работу!"
  },
  {
    "name": "Надежда",
    "course": "Курс «Хуньюаньгун»",
    "text": "Наташа, здравствуйте! Хочу написать огромное спасибо за заключительный урок.И за курс целиком. Точки и Даньтяни стали очень хорошо ощущаться и более структурированы, что ли. Теперь происходит так, что во время разминки всё включается, дышит и вращается. Например, намотка плеча и локтя очень ясно включает открытие-закрытие Тяньчжун и Хуэйинь, и вращение большой сферы. Я думала, это займёт время, чтобы оно всё начало соединяться, а получилось само))"
  },
  {
    "name": "Ирина",
    "course": "",
    "text": "Спасибо вам огромное за всё: вашу щедрость — как вы делитесь знаниями, подарками, как создаете чудесную атмосферу ваших занятий, к которым хочется возвращаться, участвуя, постигая, восхищаясь — в таком настроении усвоение, интеграция знаний и наработка умений происходит легко и естественно.."
  },
  {
    "name": "Рашид",
    "course": "",
    "text": "«Случайности не случайны». Ваши курсы вдохновили перейти от случайных занятий к регулярной практике. Впечатлений и новых ощущений масса, тонкий и одновременно емкий переход от Алфавита к Азбуке… (мне были более менее знакомы практически все базовые элементы тайцзы, синьи и багуа, кроме тайцзибана и нейгун), но в Вашей трактовке (аранжировке) просто джаз. Весьма признателен за представленную возможность …. Материала громадье..."
  }
]
