import cn from 'classnames/bind';

import { TeacherMiniBlock } from '../../components/TeacherMiniBlock/TeacherMiniBlock';

import borisova from '../../images/teachers/borisova.jpg';
import chernousov from '../../images/teachers/chernousov.jpg';
import itskovitch from '../../images/teachers/itskovitch.jpg';
import chistakov from '../../images/teachers/chistakov.jpg';

import styles from './styles.module.css';

const cx = cn.bind(styles);

export const Teachers = () => {
  return (
    <div className={cx('teachers')}>
      <TeacherMiniBlock
        imgUrl={borisova}
        name="Борисова Наташа"
        text="С детства влюблена в мир восточных единоборств. Занимаюсь ушу с 1996 года, цигун и тайцзицюань с 2002. Училась в Академии Фэн Чжицяна (Пекин), а в 2016 стала прямым учеником мастера Чэнь Сяна и официальным представителем третьего поколения Хуньюань Тайцзи в России. В настоящее время веду индивидуальные занятия в Санкт-Петербурге и развиваю онлайн школу, чтобы как можно больше людей познакомились с теорией и практикой Тайцзи и Цигун. Подробную биографию можно почитать здесь."
        isButton={true}
      />
      <TeacherMiniBlock
        imgUrl={chernousov}
        name="Черноусов вадим"
        text="Опытный практик и тренер тайцзицюань. Стаж преподавания с 1989 года. Ведет регулярные занятия в Череповце, проводит семинары в Москве. Специализация - традиционные техники тайцзицюань и цигун. Дополнительная специализация- восстановительные практики для людей с проблемамиопорно-двигательного аппарата, позвоночника, нарушениями органов дыхания. Аттестован Пекинской Академией Тайцзицюань им. Фэн Чжицяна. Продолжает обучение у китайских мастеров."
        isButton={true}
      />
      <TeacherMiniBlock
        imgUrl={itskovitch}
        name="Ицкович Ксения"
        text='С 12 лет я изучаю китайский язык и занимаюсь ушу. Три года прожила в Китае, там же закончила Университет.С 2010 года занимаюсь цигун, тайцзицюань стиля "Чэнь Ши Синьи Хуньюань Тайцзи". 
        Обучаю методам Нэйгун (для здоровья), традиционной технике Тайцзи, Синьи и Багуа, формамс оружием (меч, копьё). Сейчас работаю как устный переводчик и преподаватель китайского языка, выезжаю в командировки в Китай и обожаю утешествовать.'
        isButton={true}
      />
      <TeacherMiniBlock
        imgUrl={chistakov}
        name="Чистяков Сергей"
        text='С детства занимаюсь карате, рукопашным боем, таеквон-до(ITF федерация), дзюдзюцо, боксом.
        С 2012 года практикую тайцзицюань стиля "Чэнь Ши Синьи Хуньюань Тайцзи".
        В жизни стремлюсь быть расслабленным и умиротворённым, а так же внедрять практику расслабления в современную жизнь: работу программистом и свои активные увлечения.'
        isButton={true}
      />
    </div>
  );
};
